# Pandas Example6

In [2]:
import pandas as pd
import numpy as np

In [4]:
# Create DataFrame
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100], 
                        'Class2': [91, 93, 97, 99]}) 
df2 = pd.DataFrame({'Class1': [87, 89], 
                        'Class2': [85, 90]})

In [9]:
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [10]:
df2

   Class1  Class2
0      87      85
1      89      90

In [7]:
df3 = df1.append(df2)

In [8]:
df3

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [11]:
df4 = pd.DataFrame({'Class3': [93, 91, 95, 98]}) 
df5 = pd.DataFrame({'Class4': [82, 92]})

In [12]:
df4

   Class3
0      93
1      91
2      95
3      98

In [13]:
df5

   Class4
0      82
1      92

In [14]:
print(df1.append(df2, ignore_index=True))

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [16]:
print(df1.join(df4))

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [20]:
print(df1.join(df5))

   Class1  Class2  Class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN